# Taps
tap 'homebrew/bundle'
tap 'oven-sh/bun'

# Binaries
brew 'ansible'  # Hardware configuration automation
brew 'bat'      # A cat(1) clone with wings.
brew 'boxes'    # Draw boxes around text
brew 'bun'      # Superfast javascript runtime/bundler/pm
brew 'ca-certificates'
brew 'cowsay'   # The configurable talking cow
brew 'curl'     # get a file from a server (latest release version)
brew 'direnv'   # Environment switcher for the shell
brew 'duf'      # Disk Usage/Free Utility
brew 'eza'      # Easy Zoxide Alias
brew 'fastfetch'# Fast system info script
brew 'fzf'      # Fuzzy finder for your shell
brew 'gh'       # GitHub CLI
brew 'git-delta'# Syntax highlighting pager for git and diff output
brew 'gnupg'    # GNU Pretty Good Privacy (PGP)
brew 'lolcat'   # Rainbows and unicorns!
brew 'mackup'   # Mac settings backup
brew 'neovim'   # Extensible and agile vim fork
brew 'ripgrep'  # Better grep
brew 'sqlite'   # CLI for sqlite
brew 'starship' # Cross-shell customizable terminal prompt
brew 'tlrc'     # TLDR.sh Rust Client
brew 'tmux'     # Terminal multiplexer
brew 'xh'       # Fast & friendly HTTP client
brew 'zoxide'   # A faster way to navigate your filesystem

# Applications
# cask '1password'
# cask 'brave-browser'
# cask 'cursor'
cask 'discord'
# cask 'figma'
cask 'firefox'
cask 'ghostty'
# cask 'helo'
cask 'herd'
# cask 'insomnia'
# cask 'kitty'
cask 'linear-linear'
cask 'logi-options+'
cask 'logitech-g-hub'
#cask 'microsoft-teams'
#cask 'microsoft-outlook'
cask 'notion'
cask 'obs'
cask 'obsidian'
cask 'protonvpn'
cask 'proton-pass'
cask 'proton-mail'
cask 'proton-drive'
cask 'raycast'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'tailscale'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-cascadia-code-nf'
cask 'font-cascadia-mono'
cask 'font-cascadia-mono-pl'
cask 'font-cascadia-mono-nf'
cask 'font-fira-code-nerd-font'
cask 'font-geist'
cask 'font-geist-mono'
cask 'font-geist-mono-nerd-font'
cask 'font-inconsolata'
cask 'font-inconsolata-nerd-font'
cask 'font-inter'
cask 'font-lato'
cask 'font-monaspace'
cask 'font-monaspace-nerd-font'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-roboto-mono-nerd-font'
