# Taps
tap 'homebrew/bundle'

# Binaries
brew '1password-cli'
brew 'eza'
brew 'gh'
brew 'gnupg'
brew 'httpie'
brew 'lolcat'
brew 'mackup'
brew 'neovim'
brew 'sqlite'
brew 'tmux'

# Applications
cask '1password'
cask 'brave-browser'
cask 'cursor'
cask 'discord'
cask 'figma'
cask 'herd'
cask 'httpie'
cask 'insomnia'
cask 'kitty'
cask 'linear-linear'
cask 'logi-options+'
cask 'logitech-g-hub'
cask 'microsoft-teams'
cask 'microsoft-outlook'
cask 'notion'
cask 'obs'
cask 'protonvpn'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'tailscale'
cask 'tinkerwell'

# Fonts
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-cascadia-code-nf'
cask 'font-cascadia-mono'
cask 'font-cascadia-mono-pl'
cask 'font-cascadia-mono-nf'
cask 'font-fira-code-nerd-font'
cask 'font-geist'
cask 'font-geist-mono'
cask 'font-geist-mono-nerd-font'
cask 'font-inconsolata'
cask 'font-inconsolata-nerd-font'
cask 'font-inter'
cask 'font-lato'
cask 'font-monaspace'
cask 'font-monaspace-nerd-font'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-roboto-mono-nerd-font'
